"use strict"

/*
ЗАДАЧА №1

В консоль потрапить 1. 

++someVar - 0+1=1
if (someVar) - 1 - true, якщо true, то виконується код у тілі if-чика - вивід значення змінної someVar
*/

//ЗАДАЧА №2

for (let i = 1; i <= 10; ++i) {
   console.log(`Пункт №${i}`)
}

/*
let i = 1; - ініціалізація змінної i
i <= 10; - умова при, якій цикл виконується
++i - ну і, власне, те що виконує цикл - додає 1 до значення змінної i, робить це поки значення i не стане більше 10, якщо вже 11, то код в тілі циклу не виконується і цикл завершує свою роботу
*/

//ЗАДАЧА №3
/*
В консоль нічого не потрапить
По-перше: щоб щось потрапило в консоль його потрібно вивести. Одним із способів щось вивести в консоль є console.log(); Як бачимо в тілі if-чика воно є. 

Тепер, щоб виконався console.log('000'); треба, щоб виконалась (була true) умова у if-чику. Як працюють оператори ||(якщо хоч один операнд true, то результат - true) &&(якщо хоч один - false, то стоп, решта операндів не перевіряються, результат false). Під результатом маю на увазі саме значення типу Boolean, оскільки мої дороговартісні дослідження показали, що if конвертує результат логічних операцій у булевий тип, спробуйте вивести console.log(NaN || 0), ось що маю на увазі (виведеться небулеве значення, хіба що одне зі значень явно буде вказано як true чи false)

30 / 2 < 5 && 10 <= "10" - false && false(<= - з приведенням типів) -> false
2 * 20 <= 10 - false 
20 === "20" - false. === - не переведе рядок в число, число 20 не дорівнює рядку 20. Умова не виконалась, в консоль нічого не потрапить  
*/

//ЗАДАЧА 4

function divide(a, b) {
   const result = parseFloat(a) / parseFloat(b)

   if (isFinite(result)) {
      return `Результат ділення: ${result}`
   }
   else {
      if (typeof a !== "undefined" && typeof b !== "undefined") {
         if (b === 0) {
            return `На нуль ділити неможна, лише множити... своїх конкурентів`
         }
         else if (a == Infinity || a == -Infinity) {
            return `Немає ніякого сенсу ділити Її Величність Нескінченність на будь-що, у вас нічого не вийде, змиріться з цією істиною, ви всього лише безпомічна молекула в безмежному океані Нескінченності...`
         }
         else if (String(a).toUpperCase() === "АНАСТАСІЯ" && b > 1) {
            return `Ого! Хочете поділити Менторатрицю? Дєрзко... Але я поспішу вас застерегти від цього, мабуть, наймазомахістичного вчинку у вашому житті. Не варто, правда... не варто навіть думати про таке, оскільки ви опинитесь не на благословенному богами Фронтенду троні, а на м'ясному прилавку поруч з табличкою "СВИНИНА"`
         }
         else {
            return `Ділити можна лише числа, а також майно, після розлучення`
         }
      }
      else {
         return `Шановний/на/не, а числа за вас хто вставить? Ох вже ці юзери - все їм принеси та подай...`
      }
   }
}

console.log(divide(-Number.MAX_VALUE * 2,8))
console.log(divide("56px","34px"))
console.log(divide(NaN,"34px"))

//ЗАДАЧА 5

const array = [{name: "Denis", surname: "Bergkamp"}, 10, "Oh, man, I shot Marvin in the face", "10", ["Республіка Фронтенд", "Королівство Бекенд", "Третій Дизайнерський Рейх", 10]]

if (Array.isArray(array) && array.length > 0) {
   array.forEach((element, index) => {
      if (element === 10) {
         console.log(`Шуканий елемент ${element}, його індекс - ${index}`)
      }
   })
}
else {
   console.log(`Це точно масив? А він точно заповнений? Ось інфа про цей об'єкт:`)
   console.table({object: array, type: typeof array})
}


